{
    "id": "EI2",
    "registered": 12,
    "eName": "ICAR-JRF",
    "tName": "Plant Science",
    "title": "Plant Science",
    "about": "Plant science basics",
    "description": "This course is for ICAR-JRF Plant science aspirants. In this test series we have covered questions from 2.1: Plant Breeding & Genetics, 2.2: Plant Pathology, 2.3: Agricultural Microbiology/Microbiology, 2.4: Seed Science & Technology, 2.5: Plant Genetic Resources UNIT-I: Importance of Agriculture in national economy; basic principles of crop production; cultivation of rice,wheat, chickpea, pigeon-pea, sugarcane, groundnut, tomato, potato and mango. Major soils of India,role of NPK and their deficiency symptoms. UNIT-II: Structure and function of cell organelles; mitosis and meiosis; Mendelian genetics; elementary knowledge of photosynthesis; respiration, and transpiration; structure and functions of carbohydrates, proteins, nucleic acids, enzymes and vitamins. Major pests and diseases of rice, wheat, cotton, chickpea, sugarcane and their management. UNIT-III: Characteristics of prokaryotic and eukaryotic organisms, differences between fungi, bacteria, mycoplasmas and viruses; physical and chemical basis of heredity; chromosome structure; genes/operon concept;protein biosynthesis; transformation, recombination, Heterosis; Elements of economic botany; integrated diseases management; sterilisation, disinfection and pasteurization; Koch’s postulates; etiological agents of rusts, smuts, powdery/downy mildews, wilts, yellows, mosaic, necrosis, enations, blights and witchesbroom; pH, buffer, vitamins, role of plant hormones in seed germination and dormancy; pollination / fertilization in flowering plants; methods of seed testing; breeders, foundation and certified seeds; seed production in self and cross pollinated crops, nitrate assimilation; biological nitrogen fixation and other uses of microorganisms in agriculture. UNIT-IV: Food and industry; composting and biogas production. Important rural development programmes in India;organizational set up of agricultural research, education and extension in India.",
    "price": 50,
    "rating": 5,
    "bestSeller": true,
    "language": ["English"],
    "tests": [
        ["Level 1", 50, 50],
        ["Level 2", 50, 50]
    ]
}